# Составной оператор присваивания объединяет в себе простое присваивание и
# арифметическую бинарную операцию (+=, -= и т.д).

number = 9.0
print("number = " + str(number))

number -= 2
print("number = " + str(number))
number -= 4
print("number = " + str(number))
number += 17.567
print("number = " + str(number))
number *= 6
print("number = " + str(number))
number /= 7
print("number = " + str(number))
# Попрактикуйтесь в использовании разных типов составных операторов для переменной number
# Выведите результаты в консоль
number = 9.0
number += 5
print("number = " + str(number))
