a = b = 2  # Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.
print("a = " + str(a))  # Функция str() используется для приведения типа аргумента к строковому
print("b = " + "str(b)")
hello = "Привет"
print("hello = " + str(hello))
# Переопределите значение переменной hello
hello = "Не пока"
print("hello = " + str(hello))

a = 6
bac = 5.987
c = True
print(a, " ", bac, " ", c)
# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел
