"""
Как и в любом другом языке программирования, в Python поддерживаются стандартные математические операции:
сложение (+), вычитание (-), умножение (*), деление (/).
Помимо этого в языке также поддерживается возведение в степень (**) и получение остатка по модулю (%).
"""

number = 9.0
b = number / 2
c = number % 2
k = number // 2
# Посчитайте целую часть от деления number на 2.


# Также посчитайте остаток от предыдущей операции и выведите результат обеих операций в консоль
print("result = " + str(b))
print("remainder = " + str(c))
print("result целая часть = " + str(k))
